javascript:
(function(){

  const sell_R_list = [
      "＜新米冒険者＞エマ"
    , "＜牛人＞アイリス"
    , "＜騎士見習い＞オリアナ"
    , "＜少女剣士＞カレン"
    , "＜情報屋＞ギタ"
    , "＜闘争娘子＞ジーナ"
    , "＜悪戯エルフ＞プリモ"
    , "＜花飾の仕立屋＞ルチア"
    , "＜幼き女神＞ヘスティア"
    , "＜鍛冶師＞ヴェルフ"
    , "＜狐人＞春姫"
    , "＜剣士＞アイズ"
    , "＜道化女神＞ロキ"
    , "＜団長＞フィン"
    , "＜麗人＞リヴェリア"
    , "＜狂戦士＞ティオネ"
    , "＜闘士＞ティオナ"
    , "＜狼人＞ベート"
    , "＜魔導士＞レフィーヤ"
    , "＜冷静沈着＞アスフィ"
    , "＜放浪神＞ヘルメス"
    , "＜鍛冶神＞ヘファイストス"
    , "＜看板娘＞シル"
    , "＜エルフの店員＞リュー"
  ];

  main();

  function main(){
    const game_frame = document.querySelector('#game_frame').contentDocument;
    const selector = (id) => `#outputSellOffItemList > ul > li > div[data-item-code="${id}"][data-sidet-selected="0"][data-lock-flg="0"][data-thumb-mask-flg="0"]`;
    sell_R_list.forEach(x=> {
      const item_code= get_itemcode(x);
      game_frame.querySelectorAll(selector(item_code)).forEach(x=>x.click());
    });
  }

  function get_itemcode(name){
    const R_card_list = {
        "＜新米冒険者＞エマ": 10510001
      , "＜牛人＞アイリス": 10510002
      , "＜騎士見習い＞オリアナ": 10510003
      , "＜少女剣士＞カレン": 10510004
      , "＜情報屋＞ギタ": 10510005
      , "＜闘争娘子＞ジーナ": 10510006
      , "＜悪戯エルフ＞プリモ": 10510007
      , "＜お茶目な猫人＞ラブ": 10510008
      , "＜花飾の仕立屋＞ルチア": 10510009
      , "＜無垢な戦士＞レオ": 10510010
      , "＜冒険者＞ベル": 10510011
      , "＜幼き女神＞ヘスティア": 10510012
      , "＜サポーター＞リリルカ": 10510013
      , "＜鍛冶師＞ヴェルフ": 10510014
      , "＜極東の忍＞命": 10510015
      , "＜狐人＞春姫": 10510016
      , "＜剣士＞アイズ": 10510017
      , "＜道化女神＞ロキ": 10510018
      , "＜団長＞フィン": 10510019
      , "＜麗人＞リヴェリア": 10510020
      , "＜狂戦士＞ティオネ": 10510021
      , "＜闘士＞ティオナ": 10510022
      , "＜狼人＞ベート": 10510023
      , "＜魔導士＞レフィーヤ": 10510024
      , "＜武神＞タケミカヅチ": 10510025
      , "＜極東の少女＞千草": 10510026
      , "＜冷静沈着＞アスフィ": 10510027
      , "＜放浪神＞ヘルメス": 10510028
      , "＜薬神＞ミアハ": 10510029
      , "＜鍛冶神＞ヘファイストス": 10510030
      , "＜看板娘＞シル": 10510031
      , "＜エルフの店員＞リュー": 10510032
      , "＜アドバイザー＞エイナ": 10510033
      , "＜優しき女神＞ディア": 10510034
      , "＜銀の腕＞ナァーザ": 10510035
      , "＜美の女神＞フレイヤ": 10510036
      , "＜白巫女＞フィルヴィス": 10510037
      , "＜紅白の狐人＞紅葉": 10510038
      , "＜剛健の兎人＞楓": 10510039
      , "＜受付はこちら＞ミィシャ": 10510040
      , "＜淑女のふるまい＞エステル": 10510044
      , "＜怪力の小人＞ココ": 10510045
      , "＜秀逸の技術＞マルコ": 10510046
      , "＜オレ様曰く＞アエーシュマ": 10510047
      , "＜重傑＞ガレス": 10510048
      , "＜メイド長の使命＞イザベル": 10510049
    };

    return R_card_list[name];
  }

})();
